IDEA StatiCa Open Model
ConnectionCheckRes.Messages Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the list of errors, that apears during validation and/or calculation.
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public OpenMessages Messages { get; set; }
Public Property Messages As OpenMessages
	Get
	Set
public:
property OpenMessages^ Messages {
	OpenMessages^ get ();
	void set (OpenMessages^ value);
}
Property Value
Type: OpenMessages
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace